In [1]:
import numpy as np
import pandas as pd

# Series

In [2]:
a = pd.Series([20, 15, 14, 13])
a

0    20
1    15
2    14
3    13
dtype: int64

In [3]:
b = pd.Series([20, 15, 14, 13], index=["Math", "Chem", "physics","algebra"])
b

Math       20
Chem       15
physics    14
algebra    13
dtype: int64

In [74]:
b1 = pd.Series({"Math" : 20, "Chem" : 15, "physics" : 14, "algebra" : 13})
b1

Math       20
Chem       15
physics    14
algebra    13
dtype: int64

In [4]:
b.reindex(["Math", "Chem", "physics","Probablity"])

Math          20.0
Chem          15.0
physics       14.0
Probablity     NaN
dtype: float64

In [5]:
b

Math       20
Chem       15
physics    14
algebra    13
dtype: int64

In [12]:
b = b.reindex(["Math", "Chem", "physics","Probablity"])
b

Math          20.0
Chem          15.0
physics       14.0
Probablity    12.0
dtype: float64

In [11]:
b["Probablity"]=12

In [13]:
b = b.reindex(["Math", "Chem", "physics","Probablity"])
b

Math          20.0
Chem          15.0
physics       14.0
Probablity    12.0
dtype: float64

In [14]:
b.index

Index(['Math', 'Chem', 'physics', 'Probablity'], dtype='object')

In [15]:
b[0:2]

Math    20.0
Chem    15.0
dtype: float64

In [16]:
b.iloc[:2]

Math    20.0
Chem    15.0
dtype: float64

In [17]:
b.index.name = "Course"
b

Course
Math          20.0
Chem          15.0
physics       14.0
Probablity    12.0
dtype: float64

In [19]:
b.name = "score"
b

Course
Math          20.0
Chem          15.0
physics       14.0
Probablity    12.0
Name: score, dtype: float64

In [20]:
b.drop("Math")

Course
Chem          15.0
physics       14.0
Probablity    12.0
Name: score, dtype: float64

In [21]:
b

Course
Math          20.0
Chem          15.0
physics       14.0
Probablity    12.0
Name: score, dtype: float64

In [24]:
b=b.drop(["Chem", "physics"])
b

Course
Probablity    12.0
Name: score, dtype: float64

In [27]:
c = pd.Series([2, 5, 9, 4, 6, 7, 8], index=['a', 'b', 'c', 'd', 'e', 'f', 'h'])
c

a    2
b    5
c    9
d    4
e    6
f    7
h    8
dtype: int64

In [28]:
c.pop("b")

5

In [29]:
c

a    2
c    9
d    4
e    6
f    7
h    8
dtype: int64

In [30]:
d = pd.Series([2, 5, 9, np.NaN, 6, 7, 8], index=['a', 'b', 'c', 'd', 'e', 'f', 'h'])
d

a    2.0
b    5.0
c    9.0
d    NaN
e    6.0
f    7.0
h    8.0
dtype: float64

In [33]:
d.isna()

a    False
b    False
c    False
d     True
e    False
f    False
h    False
dtype: bool

In [32]:
d.notna()

a     True
b     True
c     True
d    False
e     True
f     True
h     True
dtype: bool

In [34]:
d

a    2.0
b    5.0
c    9.0
d    NaN
e    6.0
f    7.0
h    8.0
dtype: float64

In [36]:
d_copy = d.copy()
d_copy

a    2.0
b    5.0
c    9.0
d    NaN
e    6.0
f    7.0
h    8.0
dtype: float64

In [37]:
d["d"]=3
d

a    2.0
b    5.0
c    9.0
d    3.0
e    6.0
f    7.0
h    8.0
dtype: float64

In [38]:
d.sort_values()

a    2.0
d    3.0
b    5.0
e    6.0
f    7.0
h    8.0
c    9.0
dtype: float64

In [39]:
d.sort_values(ascending=False)

c    9.0
h    8.0
f    7.0
e    6.0
b    5.0
d    3.0
a    2.0
dtype: float64

In [40]:
d_copy.sort_values()

a    2.0
b    5.0
e    6.0
f    7.0
h    8.0
c    9.0
d    NaN
dtype: float64

In [41]:
d_copy.sort_values(ascending=False)

c    9.0
h    8.0
f    7.0
e    6.0
b    5.0
a    2.0
d    NaN
dtype: float64

In [43]:
e = pd.Series([2, 5, 9, 3, 6, 7, 8], index=['a', 'b', 'h', 'b', 'a', 'b', 'h'])
e

a    2
b    5
c    9
b    3
a    6
b    7
h    8
dtype: int64

In [44]:
e["b"]

b    5
b    3
b    7
dtype: int64

In [46]:
e.describe()

count    7.000000
mean     5.714286
std      2.563480
min      2.000000
25%      4.000000
50%      6.000000
75%      7.500000
max      9.000000
dtype: float64

In [47]:
e.mean()

5.714285714285714

In [51]:
e.quantile([0.25, 0.5, 0.75])

0.25    4.0
0.50    6.0
0.75    7.5
dtype: float64

In [53]:
e

a    2
b    5
c    9
b    3
a    6
b    7
h    8
dtype: int64

In [54]:
e >= 4

a    False
b     True
c     True
b    False
a     True
b     True
h     True
dtype: bool

In [55]:
e.where(e >= 4)

a    NaN
b    5.0
c    9.0
b    NaN
a    6.0
b    7.0
h    8.0
dtype: float64

In [56]:
e.duplicated()
#search
#e.drop_duplicate()

a    False
b    False
c    False
b    False
a    False
b    False
h    False
dtype: bool

In [58]:
f = pd.Series([12, 5, 6])
g = pd.Series([2, 10, 7])

In [59]:
f + g

0    14
1    15
2    13
dtype: int64

In [60]:
f.add(g)

0    14
1    15
2    13
dtype: int64

In [62]:
f.subtract(g)

0    10
1    -5
2    -1
dtype: int64

In [63]:
f.multiply(g)

0    24
1    50
2    42
dtype: int64

In [65]:
f.divide(g)

0    6.000000
1    0.500000
2    0.857143
dtype: float64

In [66]:
h = pd.Series([12, 5, 6], index=['a', 'b', 'c'])
k = pd.Series([2, 10, 7], index=['a', 'b', 'd'])

In [95]:
h0 = h.append(k)

In [97]:
h0 , h

(a    12
 b     5
 c     6
 a     2
 b    10
 d     7
 dtype: int64,
 a    12
 b     5
 c     6
 dtype: int64)

In [99]:
h.combine(k, max)

a    12.0
b    10.0
c     6.0
d     NaN
dtype: float64

In [100]:
h.combine(k, max, fill_value=0)

a    12
b    10
c     6
d     7
dtype: int64

In [67]:
h.add(k)

a    14.0
b    15.0
c     NaN
d     NaN
dtype: float64

In [68]:
h.add(k, fill_value=0)

a    14.0
b    15.0
c     6.0
d     7.0
dtype: float64

In [69]:
x = pd.Series([12, 5, 6, 8, 9, 11])
z = pd.Series([2, 10, 7, 8, 9, 11])

In [70]:
x.eq(z)

0    False
1    False
2    False
3     True
4     True
5     True
dtype: bool

In [71]:
x.ne(z)

0     True
1     True
2     True
3    False
4    False
5    False
dtype: bool

In [72]:
x.gt(z)

0     True
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [73]:
x.lt(z)

0    False
1     True
2     True
3    False
4    False
5    False
dtype: bool

In [75]:
b1

Math       20
Chem       15
physics    14
algebra    13
dtype: int64

In [77]:
b1.argmax()

0

In [80]:
b1.idxmin()

'algebra'

In [81]:
b

Math       20
Chem       15
physics    14
algebra    13
dtype: int64

In [82]:
y = pd.Series([2, 5, 9, np.NaN, 6, 7, 8])
y

0    2.0
1    5.0
2    9.0
3    NaN
4    6.0
5    7.0
6    8.0
dtype: float64

In [83]:
y.cumsum()

0     2.0
1     7.0
2    16.0
3     NaN
4    22.0
5    29.0
6    37.0
dtype: float64

In [84]:
y.cumprod()

0        2.0
1       10.0
2       90.0
3        NaN
4      540.0
5     3780.0
6    30240.0
dtype: float64

In [90]:
p = pd.Series( ['a','x', 'x', 'b', 'h', 'b', 'a', 'b', 'h'])
p

0    a
1    x
2    x
3    b
4    h
5    b
6    a
7    b
8    h
dtype: object

In [91]:
p.value_counts()

b    3
a    2
x    2
h    2
dtype: int64

In [92]:
p.unique()

array(['a', 'x', 'b', 'h'], dtype=object)

In [93]:
n = pd.Series( ['a','x', 'x', 'b', 'h', 'b', 'a', 'b', 'h']).unique()
n

array(['a', 'x', 'b', 'h'], dtype=object)

In [101]:
x

0    12
1     5
2     6
3     8
4     9
5    11
dtype: int64

In [103]:
x.apply(np.log10)
#ba stefade az apply va def ya lambda taghir bar roye seriess ijad konid
#def
#lambda

0    1.079181
1    0.698970
2    0.778151
3    0.903090
4    0.954243
5    1.041393
dtype: float64

In [104]:
x.transform([np.sqrt, np.log10])

       sqrt     log10
0  3.464102  1.079181
1  2.236068  0.698970
2  2.449490  0.778151
3  2.828427  0.903090
4  3.000000  0.954243
5  3.316625  1.041393

In [ ]:
#agg
#groupby

# DataFrame

In [114]:
m = np.random.randint(8, 20, size = 16).reshape(4, 4)
Course = ["Math", "Chem", "physics","algebra"]
Name = ['Amir', "Soheil", 'Nima', 'Elahe']
m

array([[ 9, 15, 16, 13],
       [13,  8, 17, 18],
       [14, 13, 17, 18],
       [18, 10, 12,  8]])

In [115]:
Hadi = pd.DataFrame(data = m, index = Name , columns = Course)
Hadi

        Math  Chem  physics  algebra
Amir       9    15       16       13
Soheil    13     8       17       18
Nima      14    13       17       18
Elahe     18    10       12        8

In [118]:
HH = {"Math" : [ 9, 15, 16, 13], "Chem" : [13,  8, 17, 18], "physics" : [14, 13, 17, 18],"algebra" : [18, 10, 12,  8]}
Hadi0 = pd.DataFrame(data = HH , index = Name)
Hadi0

        Math  Chem  physics  algebra
Amir       9    13       14       18
Soheil    15     8       13       10
Nima      16    17       17       12
Elahe     13    18       18        8

In [123]:
Hadi.to_csv('D:Pandas/Nomreha.csv') #addres pc khod ra vared konid dar parantez

In [125]:
pd.read_csv('D:Pandas/Nomreha.csv', header=None) #addres pc khod ra vared konid dar parantez

        0     1     2        3        4
0     NaN  Math  Chem  physics  algebra
1    Amir     9    15       16       13
2  Soheil    13     8       17       18
3    Nima    14    13       17       18
4   Elahe    18    10       12        8

In [127]:
Hadi.to_excel('D:Pandas/Nomreha.xlsx')#addres pc khod ra vared konid dar parantez

In [128]:
pd.read_excel('D:Pandas/Nomreha.xlsx', header=None)#addres pc khod ra vared konid dar parantez

        0     1     2        3        4
0     NaN  Math  Chem  physics  algebra
1    Amir     9    15       16       13
2  Soheil    13     8       17       18
3    Nima    14    13       17       18
4   Elahe    18    10       12        8

In [129]:
# in do ketab khane ra nasb konid
# Lxml
# html5lib

In [133]:
Dataframe_Structure_1 = {'City' : ['Mashhad', 'Mashhad', 'Mashhad', 'Shahrood', 'Shahrood', 'Shahrood'],
                      'Year' : [1400, 1399, 1398, 1400, 1399, 1398],
                      "Population" : [5, 6, 7, 1, 1.5, 1.2]}
l1 = pd.DataFrame(data = Dataframe_Structure_1)
l1

       City  Year  Population
0   Mashhad  1400         5.0
1   Mashhad  1399         6.0
2   Mashhad  1398         7.0
3  Shahrood  1400         1.0
4  Shahrood  1399         1.5
5  Shahrood  1398         1.2

In [134]:
Dataframe_Structure_2= {'Mashhad' : {1400 : 5, 1399 : 6, 1398 : 7},
                         'Shahrood': {1400 : 1, 1399 : 1.5, 1398 : 1.2}}
l2 = pd.DataFrame(data = Dataframe_Structure_2)
l2

      Mashhad  Shahrood
1400        5       1.0
1399        6       1.5
1398        7       1.2

In [140]:
l1 + l2

     City  Mashhad  Population  Shahrood  Year
0     NaN      NaN         NaN       NaN   NaN
1     NaN      NaN         NaN       NaN   NaN
2     NaN      NaN         NaN       NaN   NaN
3     NaN      NaN         NaN       NaN   NaN
4     NaN      NaN         NaN       NaN   NaN
5     NaN      NaN         NaN       NaN   NaN
1398  NaN      NaN         NaN       NaN   NaN
1399  NaN      NaN         NaN       NaN   NaN
1400  NaN      NaN         NaN       NaN   NaN

In [137]:
l2.index.name = 'Year'
l2.columns.name = 'City'
l2

City  Mashhad  Shahrood
Year
1400        5       1.0
1399        6       1.5
1398        7       1.2

In [138]:
Hadi

        Math  Chem  physics  algebra
Amir       9    15       16       13
Soheil    13     8       17       18
Nima      14    13       17       18
Elahe     18    10       12        8

In [149]:
Hadi.iloc[2]

Math       14
Chem       13
physics    17
algebra    18
Name: Nima, dtype: int32

In [145]:
Hadi.iloc[[2]]

      Math  Chem  physics  algebra
Nima    14    13       17       18

In [146]:
Hadi.loc['Nima']

Math       14
Chem       13
physics    17
algebra    18
Name: Nima, dtype: int32

In [147]:
Hadi.loc[['Nima']]

      Math  Chem  physics  algebra
Nima    14    13       17       18

In [150]:
Hadi.iloc[:2]

        Math  Chem  physics  algebra
Amir       9    15       16       13
Soheil    13     8       17       18

In [151]:
Hadi.loc[:'Nima']

        Math  Chem  physics  algebra
Amir       9    15       16       13
Soheil    13     8       17       18
Nima      14    13       17       18

In [152]:
Hadi.loc[:'Nima', 'Chem']

Amir      15
Soheil     8
Nima      13
Name: Chem, dtype: int32

In [153]:
Hadi.iloc[:3, 1]

Amir      15
Soheil     8
Nima      13
Name: Chem, dtype: int32

In [154]:
Hadi.iloc[[False, True, False, True]]

        Math  Chem  physics  algebra
Soheil    13     8       17       18
Elahe     18    10       12        8

In [155]:
Hadi

        Math  Chem  physics  algebra
Amir       9    15       16       13
Soheil    13     8       17       18
Nima      14    13       17       18
Elahe     18    10       12        8

In [156]:
Hadi.iat[0, 0]

9

In [157]:
Hadi.reindex(['Amir', "Ali", 'Nima', 'Elahe'])

       Math  Chem  physics  algebra
Amir    9.0  15.0     16.0     13.0
Ali     NaN   NaN      NaN      NaN
Nima   14.0  13.0     17.0     18.0
Elahe  18.0  10.0     12.0      8.0

In [158]:
Hadi.reindex(['Amir', "Ali", 'Nima', 'Elahe'], fill_value=0)

       Math  Chem  physics  algebra
Amir      9    15       16       13
Ali       0     0        0        0
Nima     14    13       17       18
Elahe    18    10       12        8

In [159]:
#be Ali Nomre Bedid

In [160]:
Hadi.reindex(columns = ["Math", "Chem", "physics","algebra", "Static"], fill_value=0)

        Math  Chem  physics  algebra  Static
Amir       9    15       16       13       0
Soheil    13     8       17       18       0
Nima      14    13       17       18       0
Elahe     18    10       12        8       0

In [161]:
Hadi

        Math  Chem  physics  algebra
Amir       9    15       16       13
Soheil    13     8       17       18
Nima      14    13       17       18
Elahe     18    10       12        8

In [162]:
Hadi.sort_values(by = "Math")

        Math  Chem  physics  algebra
Amir       9    15       16       13
Soheil    13     8       17       18
Nima      14    13       17       18
Elahe     18    10       12        8

In [163]:
Hadi.sort_values(by = "Math", ascending=False)

        Math  Chem  physics  algebra
Elahe     18    10       12        8
Nima      14    13       17       18
Soheil    13     8       17       18
Amir       9    15       16       13

In [165]:
Hadi

        Math  Chem  physics  algebra
Amir       9    15       16       13
Soheil    13     8       17       18
Nima      14    13       17       18
Elahe     18    10       12        8

In [166]:
Hadi.sort_index()

        Math  Chem  physics  algebra
Amir       9    15       16       13
Elahe     18    10       12        8
Nima      14    13       17       18
Soheil    13     8       17       18

In [167]:
Hadi.sort_index()
#axis

        Math  Chem  physics  algebra
Amir       9    15       16       13
Elahe     18    10       12        8
Nima      14    13       17       18
Soheil    13     8       17       18

In [168]:
Hadi

        Math  Chem  physics  algebra
Amir       9    15       16       13
Soheil    13     8       17       18
Nima      14    13       17       18
Elahe     18    10       12        8

In [169]:
Hadi.describe()

            Math       Chem    physics    algebra
count   4.000000   4.000000   4.000000   4.000000
mean   13.500000  11.500000  15.500000  14.250000
std     3.696846   3.109126   2.380476   4.787136
min     9.000000   8.000000  12.000000   8.000000
25%    12.000000   9.500000  15.000000  11.750000
50%    13.500000  11.500000  16.500000  15.500000
75%    15.000000  13.500000  17.000000  18.000000
max    18.000000  15.000000  17.000000  18.000000

In [170]:
Hadi.sum(axis = "columns")

Amir      53
Soheil    56
Nima      62
Elahe     48
dtype: int64

In [171]:
Hadi.sum(axis = "index")

Math       54
Chem       46
physics    62
algebra    57
dtype: int64

In [172]:
Hadi

        Math  Chem  physics  algebra
Amir       9    15       16       13
Soheil    13     8       17       18
Nima      14    13       17       18
Elahe     18    10       12        8

In [173]:
Hadi.T

         Amir  Soheil  Nima  Elahe
Math        9      13    14     18
Chem       15       8    13     10
physics    16      17    17     12
algebra    13      18    18      8

In [176]:
Hadi.apply(lambda x: x-5)

        Math  Chem  physics  algebra
Amir       4    10       11        8
Soheil     8     3       12       13
Nima       9     8       12       13
Elahe     13     5        7        3

In [178]:
def func(x):
    """.............""" #dakhel ......... tabei ra tarif konid
Hadi.apply(func)

Math       None
Chem       None
physics    None
algebra    None
dtype: object

In [ ]:
#pip install mitoinstaller

In [12]:
url="https://en.wikipedia.org/wiki/Tehran"
Web_DataFrame = pd.read_html(url, match="List of Tehran Metro Lines")
Web_DataFrame[0].head()

  Line Opening[69]             Length Stations[70]           Type
0    1        2001  70 km (43 mi)[71]   32[71][72]          Metro
1    2        2000  26 km (16 mi)[73]   22[72][73]          Metro
2    3        2012  37 km (23 mi)[74]   24[72][74]          Metro
3    4        2008  22 km (14 mi)[75]       22[75]          Metro
4    5        1999  43 km (27 mi)[76]   11[76][77]  Commuter rail